<script setup lang="ts"></script>

<template>
  <main :class="[$style.wrapper, 'cl_purple rounded-10 p-16']">
    <p>
      Мы деловые люди, мы привыкли вкладывать свои средства, привыкли уменьшать
      свои потери, мы ведем себя в этом мире как на базаре.
    </p>
    <p>
      А если мы «вкладываем во что-то средства», мы желаем иметь гарантии. Мы
      готовы влюбиться, но только если это будет взаимно. Если мы разлюбили, мы
      обрываем одну связь и заменяем ее другой. То, что мы называем любовью —
      это всего лишь истерика. Нас нельзя назвать страстными существами,
      бессердечными — да. Я то думал, что я знаю, как любить, но дон Хуан как-то
      сказал мне: «Ну откуда ты мог бы знать это? Тебя ведь никогда не учили
      тому, что такое любовь. Тебя учили как соблазнять, как завидовать, как
      ненавидеть, а любить тебя не учили. У тебя кишка тонка, чтобы любить так…
    </p>
    <p>
      Мог бы ты полюбить навсегда, так, чтобы эта любовь осталась и за границами
      смерти? Просто так, без всяких там «вложений»? Ты никогда не знал, что
      значит любить вот так, без всякой жалости к себе. И ты действительно
      хочешь умереть, так и не узнав этого?»
    </p>
  </main>
</template>

<style module>
.wrapper {
  border: 2px solid rgb(60, 78, 172);
}
</style>
